read_verilog adder.v toplevel.v

synth_ice40 -noflatten -blif dspadder.blif

write_json dspadder.json
